#Использовать "../src"
#Использовать asserts

Перем ЮнитТест;
Перем ТокенАвторизации;
Перем МассивВременныхФайлов;
Перем РаботаетПоискФайлов;

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт
	
	ЮнитТест = Тестирование;	
	
	ИменаТестов = Новый Массив;
	ИменаТестов.Добавить("ТестДолжен_ПроверитьПравильноеСлово");
	ИменаТестов.Добавить("ТестДолжен_ПроверитьНеправильноеСлово");
	ИменаТестов.Добавить("ТестДолжен_ПроверитьНеправельныйТекст");
	ИменаТестов.Добавить("ТестДолжен_ПроверитьНеправильноеСловоВДругойРаскладке");

	ИменаТестов.Добавить("ТестДолжен_ПроверитьВыводПодсказокСтрокой");

	ИменаТестов.Добавить("ТестДолжен_ПроверитьВозвратИсправленногоТекста_БезОшибок");
	ИменаТестов.Добавить("ТестДолжен_ПроверитьВозвратИсправленногоТекста_СОшибками");
	ИменаТестов.Добавить("ТестДолжен_ПроверитьВозвратИсправленногоТекста_СОшибками_Длинный");
	
	Возврат ИменаТестов;
	
КонецФункции // ПолучитьСписокТестов()

Процедура ПередЗапускомТеста() Экспорт
	
	
КонецПроцедуры // ПередЗапускомТеста()

Процедура ПослеЗапускаТеста() Экспорт
	
	
КонецПроцедуры // ПослеЗапускаТеста()

Процедура ТестДолжен_ПроверитьПравильноеСлово() Экспорт
	
	Спел = Новый Yaspeller();
	МассивОшибок = Спел.ПроверитьТекст("Привет");
	
	Утверждения.Проверить(ТипЗнч(МассивОшибок) = Тип("Массив"), "Ошибка проверки типа возвращаемых данных");
	Утверждения.Проверить(МассивОшибок.Количество() = 0, "Ошибка проверки неправельного слова");
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьНеправильноеСлово() Экспорт
	
	Спел = Новый Yaspeller();
	МассивОшибок = Спел.ПроверитьТекст("Превет");
	
	
	Утверждения.Проверить(ТипЗнч(МассивОшибок) = Тип("Массив"), "Ошибка проверки типа возвращаемых данных");	
	Утверждения.Проверить(МассивОшибок.Количество() = 1, "Ошибка проверки неправельного слова");
	
	Ошибка = МассивОшибок[0];
	Утверждения.Проверить(Ошибка.Подсказки.Количество() = 3, "Ошибка проверки количества подсказок");
	Утверждения.Проверить(Ошибка.Подсказки[0] = "Привет", "Ошибка проверки результата подсказки");
	
	Ошибка = МассивОшибок[0];
	
	Утверждения.Проверить(Ошибка.КодОшибки = 1, "Нерпавельное значение Кода ошибки");
	Утверждения.Проверить(Ошибка.Позиция = 0, "Неправильное значение позиции ошибочного слова");
	Утверждения.Проверить(Ошибка.Строка = 0, "Неправильное значение номера строки ошибочного слова");
	Утверждения.Проверить(Ошибка.Столбец = 0, "Неправильное значение номера столбца ошибочного слова");
	Утверждения.Проверить(Ошибка.Длина = 6, "Неправильное значение длины ошибочного слова");
	Утверждения.Проверить(Ошибка.ИсходноеСлово = "Превет", "Неправильное исходное значение ошибочного слова");
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьНеправельныйТекст() Экспорт
	
	Спел = Новый Yaspeller();
	МассивОшибок = Спел.ПроверитьТекст("Превет, как у тябя дела?");
	
	
	Утверждения.Проверить(ТипЗнч(МассивОшибок) = Тип("Массив"), "Ошибка проверки типа возвращаемых данных");	
	Утверждения.Проверить(МассивОшибок.Количество() = 2, "Ошибка проверки неправельного слова");
	
	Ошибка = МассивОшибок[0];
	Утверждения.Проверить(Ошибка.Подсказки.Количество() = 3, "Ошибка проверки количества подсказок");
	Утверждения.Проверить(Ошибка.Подсказки[0] = "Привет", "Ошибка проверки результата подсказки");
	
	ПерваяОшибка = МассивОшибок[0];
	
	Утверждения.Проверить(ПерваяОшибка.КодОшибки = 1, "Нерпавельное значение Кода ошибки первого ошибочного слова");
	Утверждения.Проверить(ПерваяОшибка.Позиция = 0, "Неправильное значение позиции ошибочного первого ошибочного слова");
	Утверждения.Проверить(ПерваяОшибка.Строка = 0, "Неправильное значение номера строки ошибочного первого ошибочного слова");
	Утверждения.Проверить(ПерваяОшибка.Столбец = 0, "Неправильное значение номера столбца ошибочного первого ошибочного слова");
	Утверждения.Проверить(ПерваяОшибка.Длина = 6, "Неправильное значение длины ошибочного первого ошибочного слова");
	Утверждения.Проверить(ПерваяОшибка.ИсходноеСлово = "Превет", "Неправильное исходное значение ошибочного первого ошибочного слова");

	ВтораяОшибка = МассивОшибок[1];
	
	Утверждения.Проверить(ВтораяОшибка.КодОшибки = 1, "Нерпавельное значение Кода ошибки второго ошибочного слова");
	Утверждения.Проверить(ВтораяОшибка.Позиция = 14, "Неправильное значение позиции ошибочного второго ошибочного слова");
	Утверждения.Проверить(ВтораяОшибка.Строка = 0, "Неправильное значение номера строки ошибочного второго ошибочного слова");
	Утверждения.Проверить(ВтораяОшибка.Столбец = 14, "Неправильное значение номера столбца ошибочного второго ошибочного слова");
	Утверждения.Проверить(ВтораяОшибка.Длина = 4, "Неправильное значение длины ошибочного второго ошибочного слова");
	Утверждения.Проверить(ВтораяОшибка.ИсходноеСлово = "тябя", "Неправильное исходное значение ошибочного второго ошибочного слова");
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьНеправильноеСловоВДругойРаскладке() Экспорт
	
	Спел = Новый Yaspeller();
	МассивОшибок = Спел.ПроверитьТекст("Plhfcndeqnt");
	
	
	Утверждения.Проверить(ТипЗнч(МассивОшибок) = Тип("Массив"), "Ошибка проверки типа возвращаемых данных");	
	Утверждения.Проверить(МассивОшибок.Количество() = 1, "Ошибка проверки неправельного слова");
	
	Ошибка = МассивОшибок[0];
	Утверждения.Проверить(Ошибка.Подсказки.Количество() = 4, "Ошибка проверки количества подсказок");
	Утверждения.Проверить(Ошибка.Подсказки[0] = "Здравствуйте", "Ошибка проверки результата подсказки");
	
	Ошибка = МассивОшибок[0];
	
	Утверждения.Проверить(Ошибка.КодОшибки = 1, "Нерпавельное значение Кода ошибки");
	Утверждения.Проверить(Ошибка.Позиция = 0, "Неправильное значение позиции ошибочного слова");
	Утверждения.Проверить(Ошибка.Строка = 0, "Неправильное значение номера строки ошибочного слова");
	Утверждения.Проверить(Ошибка.Столбец = 0, "Неправильное значение номера столбца ошибочного слова");
	Утверждения.Проверить(Ошибка.Длина = 11, "Неправильное значение длины ошибочного слова");
	Утверждения.Проверить(Ошибка.ИсходноеСлово = "Plhfcndeqnt", "Неправильное исходное значение ошибочного слова");
	
КонецПроцедуры


Процедура ТестДолжен_ПроверитьВыводПодсказокСтрокой() Экспорт

	МассивСлов = Новый Массив;
	МассивСлов.Добавить("Здравствуйте");
	МассивСлов.Добавить("Здраствуйте");
	МассивСлов.Добавить("Здрасвуйте");
	МассивСлов.Добавить("Зраствуйте");

	Данные = Новый Структура;
	Данные.Вставить("code", 1);
	Данные.Вставить("pos", 0);
	Данные.Вставить("row", 0);
	Данные.Вставить("col", 0);
	Данные.Вставить("len", 11);
	Данные.Вставить("word", "Plhfcndeqnt");
	Данные.Вставить("s", МассивСлов);

	РезультатПроверки = Новый SpellResult(Данные);

	Строка = РезультатПроверки.ПодсказкиСтрокой();
	Утверждения.Проверить(Строка = "Здравствуйте,Здраствуйте,Здрасвуйте,Зраствуйте", 
							"Нерпавельное значение результата метода ПодсказкиСтрокой");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьВозвратИсправленногоТекста_БезОшибок() Экспорт

	ВходныеДанные = "Привет, как у тебя дела?";
	Эталон = "Привет, как у тебя дела?";

	Результат = ManagerYaspeller.ПолучитьИсправленныйТекст(ВходныеДанные);
	Утверждения.Проверить(Результат = Эталон, "Нерпавельное значение результата метода ПолучитьИсправленныйТекст");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьВозвратИсправленногоТекста_СОшибками() Экспорт

	ВходныеДанные = "Превет, как у тябя дела?";
	Эталон = "Привет, как у тебя дела?";

	Результат = ManagerYaspeller.ПолучитьИсправленныйТекст(ВходныеДанные);
	Утверждения.Проверить(Результат = Эталон, "Нерпавельное значение результата метода ПолучитьИсправленныйТекст");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьВозвратИсправленногоТекста_СОшибками_Длинный() Экспорт

	ВходныеДанные = "Превет, как у тябя дела?
					|У тябя все харашо?";
	Эталон = "Привет, как у тебя дела?
			|У тебя все хорошо?";

	Результат = ManagerYaspeller.ПолучитьИсправленныйТекст(ВходныеДанные);
	Утверждения.Проверить(Результат = Эталон, "Нерпавельное значение результата метода ПолучитьИсправленныйТекст");

КонецПроцедуры